bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/soc/audio_fifo_reg.h
// Copyright 2022-2025 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// This is a generated file, if you need to modify it, use the script to
// generate and modify all the struct.h, ll.h, reg.h, debug_dump.c files!

#pragma once


#ifdef __cplusplus
extern "C" {
#endif


#define AUDIO_FIFO_SPK0_A2DP_PORT_ADDR (SOC_AUDIO_FIFO_REG_BASE + (0x40 << 2))

#define AUDIO_FIFO_SPK0_A2DP_PORT_SPK0_A2DP_POS (0)
#define AUDIO_FIFO_SPK0_A2DP_PORT_SPK0_A2DP_MASK (0xffffff)

#define AUDIO_FIFO_SPK0_A2DP_PORT_RESERVED_BIT_24_31_POS (24)
#define AUDIO_FIFO_SPK0_A2DP_PORT_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_FIFO_SPK0_CALL_PORT_ADDR (SOC_AUDIO_FIFO_REG_BASE + (0x41 << 2))

#define AUDIO_FIFO_SPK0_CALL_PORT_SPK0_CALL_POS (0)
#define AUDIO_FIFO_SPK0_CALL_PORT_SPK0_CALL_MASK (0xffffff)

#define AUDIO_FIFO_SPK0_CALL_PORT_RESERVED_BIT_24_31_POS (24)
#define AUDIO_FIFO_SPK0_CALL_PORT_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_FIFO_SPK0_HINT_PORT_ADDR (SOC_AUDIO_FIFO_REG_BASE + (0x42 << 2))

#define AUDIO_FIFO_SPK0_HINT_PORT_SPK0_HINT_POS (0)
#define AUDIO_FIFO_SPK0_HINT_PORT_SPK0_HINT_MASK (0xffffff)

#define AUDIO_FIFO_SPK0_HINT_PORT_RESERVED_BIT_24_31_POS (24)
#define AUDIO_FIFO_SPK0_HINT_PORT_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_FIFO_SPK1_A2DP_PORT_ADDR (SOC_AUDIO_FIFO_REG_BASE + (0x43 << 2))

#define AUDIO_FIFO_SPK1_A2DP_PORT_SPK1_A2DP_POS (0)
#define AUDIO_FIFO_SPK1_A2DP_PORT_SPK1_A2DP_MASK (0xffffff)

#define AUDIO_FIFO_SPK1_A2DP_PORT_RESERVED_BIT_24_31_POS (24)
#define AUDIO_FIFO_SPK1_A2DP_PORT_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_FIFO_SPK1_CALL_PORT_ADDR (SOC_AUDIO_FIFO_REG_BASE + (0x44 << 2))

#define AUDIO_FIFO_SPK1_CALL_PORT_SPK1_CALL_POS (0)
#define AUDIO_FIFO_SPK1_CALL_PORT_SPK1_CALL_MASK (0xffffff)

#define AUDIO_FIFO_SPK1_CALL_PORT_RESERVED_BIT_24_31_POS (24)
#define AUDIO_FIFO_SPK1_CALL_PORT_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_FIFO_SPK1_HINT_PORT_ADDR (SOC_AUDIO_FIFO_REG_BASE + (0x45 << 2))

#define AUDIO_FIFO_SPK1_HINT_PORT_SPK1_HINT_POS (0)
#define AUDIO_FIFO_SPK1_HINT_PORT_SPK1_HINT_MASK (0xffffff)

#define AUDIO_FIFO_SPK1_HINT_PORT_RESERVED_BIT_24_31_POS (24)
#define AUDIO_FIFO_SPK1_HINT_PORT_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_FIFO_MIC0_DATA_BUS_ADDR (SOC_AUDIO_FIFO_REG_BASE + (0x46 << 2))

#define AUDIO_FIFO_MIC0_DATA_BUS_MIC0_DATA_BUS_POS (0)
#define AUDIO_FIFO_MIC0_DATA_BUS_MIC0_DATA_BUS_MASK (0xffffff)

#define AUDIO_FIFO_MIC0_DATA_BUS_RESERVED_BIT_24_31_POS (24)
#define AUDIO_FIFO_MIC0_DATA_BUS_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_FIFO_MIC1_DATA_BUS_ADDR (SOC_AUDIO_FIFO_REG_BASE + (0x47 << 2))

#define AUDIO_FIFO_MIC1_DATA_BUS_MIC1_DATA_BUS_POS (0)
#define AUDIO_FIFO_MIC1_DATA_BUS_MIC1_DATA_BUS_MASK (0xffffff)

#define AUDIO_FIFO_MIC1_DATA_BUS_RESERVED_BIT_24_31_POS (24)
#define AUDIO_FIFO_MIC1_DATA_BUS_RESERVED_BIT_24_31_MASK (0xff)

#ifdef __cplusplus
}
#endif
